# 23 Задание

Исполнитель преобразует число на экране. У исполнителя есть три команды, которые обозначены латинскими буквами:
 
- А. Вычесть 1
- В. Вычесть 3
- С. Найти целую часть от деления на 2

Программа для исполнителя — это последовательность команд. Сколько существует программ, для которых при исходном числе 19 результатом является число 3, при этом траектория вычислений не содержит числа 7 и содержит 10? Траектория вычислений программы — это последовательность результатов выполнения всех команд программы. Например, для программы СВА при исходном числе 13 траектория будет состоять из чисел 6, 3, 2.

```python
def f(start, end):
    # в 7 мы не попадаем
    if start < end or start == 7:
        return 0
    if start == end:
        return 1
    if start > end:
        return f(start - 1, end) + f(start - 3, end) + f(start // 2, end)

# В 10 мы попадаем
print(f(19, 10) * f(10, 3))
```
