# 8 Задание
### Задание на комбинаторику

## I. Тип: цифры
    !!! ВАЖНО, 0 первый быть не может

Определите количество шестизначных чисел, записанных в восьмеричной системе счисления, в записи которых есть ровно две цифры 6, при этом никакая нечётная цифра не стоит рядом с цифрой 6.
Пример шестизначного числа, записанного в восьмеричной системе счисления – 1234568.

1) Программированием:
```python
from itertools import *

cnt = 0
for i in product('01234567', repeat=6):
    i = ''.join(i)
    if i[0] == '0':
        continue

    if i.count('6') == 2:
        i = i.replace('1', 'н').replace('3', 'н').replace('5', 'н').replace('7', 'н')
        if '6н' not in i and 'н6' not in i:
           cnt += 1
print(cnt)
```

2) Ручками:
```textmate
Всего вариантов переставить 6 в 6значном числе = 20
Всего варинтов, где 0 не первый = 6 * 7 * 7 * 7 * 7 * 7 = 100580
100580 / 20 = 5229
```

#### Ответ: 5229

## II. Тип: буквы и слова:

(Грачев Н.) Марсианин Саша составляет странные 18буквенные слова из букв Е,В,Л,А,М,П,И,Й.
Сколько существует различных странных слов,
в которых в начале слова находится сочетание букв ПИЛАЕВЛА?
Слово считается странным, если кол-во гласных и согласных букв в слове одинаково.


```python
def f(l, cg, csg):
    if l == 18: return cg == csg
    return f(l+1, cg+1, csg)*3+f(l+1, cg, csg+1)*5
print(f(8,4,4))
```

#### Ответ: 191362500

---

Из символов Е, Г, Э, 2, 0, 3 составляют 7-буквенные слова,
записанные в алфавитном порядке (Буквы вначале, цифры после).
Вот начало этого списка:
1.    ГГГГГГГ
2.    ГГГГГГЕ
3.    ГГГГГГЭ
4.    ГГГГГГ0
5.    ГГГГГГ2
6.    ГГГГГГ3
7.    ГГГГГЕГ
Какое количество слов находятся между словами ЕГЭ2023 и 2023ЕГЭ (исключая эти слова)?
```python
from itertools import *

cnt = 1
for i in product('ГЕЭ023', repeat=7):
    if ''.join(i) == 'ЕГЭ2023':
        print(cnt, i)
    if ''.join(i) == '2023ЕГЭ':
        print(cnt, i)
    cnt+=1
```
#### Ответ: 216255 - 50250 - 1 = 166004

---

Марина собирает восьмибуквенные слова из букв своего имени.
Все буквы могут многократно повторяться.
На каком месте окажется имя МАРИАННА в отсортированном по алфавиту списке сгенерированных слов?
Нумерация начинается с 1.

```python
from itertools import *

cnt = 1
for i in product('АИМНР', repeat=8):
    if ''.join(i) == 'МАРИАННА':
        print(cnt, i)
    cnt+=1
```
---
