# 14 Задание

### Конверция из 10чной в любую

```python
def convert_to(number, base, upper=False):
digits = '0123456789abcdefghijklmnopqrstuvwxyz'
if base > len(digits): return None
result = ''
while number > 0:
    result = digits[number % base] + result
    number //= base
return result.upper() if upper else result
```

## Самое сложное из встреченных:
#### В системе счисления с основанием p выполняется равенство: 1x77 + xx77 = y0yy, буквами x и y обозначены некоторые цифры из алфавита системы счисления с основанием p. Определите значение числа yxyx в p системе счисления, и запишите его значаение в десятичной   

```python
for p in range(100):
    for x in range(p):
        for y in range(p):
            f1 = p**3 + x*p**2 + 7*p + 7
            f2 = x*p**3 + x*p**2 + 7*p + 7
            s = y*p**3 + y*p + y
            if (f1 + f2) == s:
                print(p, y*p**3 + x*p**2 + y*p + x)
```