# 5 Задание

#### Все что надо:
```python
def convert_to(number, base, upper=False):
digits = '0123456789abcdefghijklmnopqrstuvwxyz'
if base > len(digits): return None
result = ''
while number > 0:
    result = digits[number % base] + result
    number //= base
return result.upper() if upper else result
```

	
№ 10658 (Уровень: Средний)
(Н. Сафронов) На вход алгоритма подаётся натуральное число N > 10. Алгоритм строит по нему новое число R следующим образом:
1. Строится троичная запись числа N.
2. К этой записи дописываются разряды по следующему правилу. Если количество четных цифр в полученной записи больше чем нечетных, слева дописывается 22, иначе 11.
3. Полученная таким образом запись является троичной записью искомого числа R.
Укажите минимальное значение R, больше  чем 100, которое может получится в результате работы алгоритма. В ответе запишите это число в десятичной системе счисления.

```python
def to_3 (N):
    str3 = ''
    while N:
        str3 += str(N%3)
        N //= 3
    return str3[::-1]

def f(N):
    str3 = to_3(N)
    ind_0 = str3.count('0')
    ind_1 = str3.count('1')
    ind_2 = str3.count('2')
    odd = ind_0 + ind_2
    R = ''

    if odd > ind_1:
        R = f'22{str3}'
    else:
        R = f'11{str3}'

    return R

arr = []
for N in range(11, 1001):
    if int(f(N), 3) > 100:
        arr.append(int(f(N), 3))
print(min(arr))
```